tests/mock_responses/2020-08-27/webhook_subscription_updated_billing_frequency.json

{
  "api_version": "2020-08-27",
  "created": 1642150619,
  "data": {
    "object": {
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false
      },
      "billing_cycle_anchor": 1642150617,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1642150469,
      "current_period_end": 1673686617,
      "current_period_start": 1642150617,
      "customer": "cus_tester",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "discount": null,
      "ended_at": null,
      "id": "sub_1KHlYHL14ex1CGCiIBo8Xk5p",
      "items": {
        "data": [
          {
            "billing_thresholds": null,
            "created": 1642150617,
            "id": "si_Kxgyikq4yxQ70f",
            "metadata": {},
            "object": "subscription_item",
            "plan": {
              "active": true,
              "aggregate_usage": null,
              "amount": 1000,
              "amount_decimal": "1000",
              "billing_scheme": "per_unit",
              "created": 1642145265,
              "currency": "usd",
              "id": "price_1KHkCLL14ex1CGCieIBu8V2e",
              "interval": "year",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": "Year subscription",
              "object": "plan",
              "product": "prod_KxfXRXOd7dnLbz",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1642145265,
              "currency": "usd",
              "id": "price_1KHkCLL14ex1CGCieIBu8V2e",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": "Year subscription",
              "object": "price",
              "product": "prod_KxfXRXOd7dnLbz",
              "recurring": {
                "aggregate_usage": null,
                "interval": "year",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "exclusive",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 1000,
              "unit_amount_decimal": "1000"
            },
            "quantity": 1,
            "subscription": "sub_1KHlYHL14ex1CGCiIBo8Xk5p",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "object": "list",
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1KHlYHL14ex1CGCiIBo8Xk5p"
      },
      "latest_invoice": "in_1KHlafL14ex1CGCiB2uebagV",
      "livemode": false,
      "metadata": {},
      "next_pending_invoice_item_invoice": null,
      "object": "subscription",
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "active": true,
        "aggregate_usage": null,
        "amount": 1000,
        "amount_decimal": "1000",
        "billing_scheme": "per_unit",
        "created": 1642145265,
        "currency": "usd",
        "id": "price_1KHkCLL14ex1CGCieIBu8V2e",
        "interval": "year",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "nickname": "Year subscription",
        "object": "plan",
        "product": "prod_KxfXRXOd7dnLbz",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1642150469,
      "status": "active",
      "transfer_data": null,
      "trial_end": null,
      "trial_start": null
    },
    "previous_attributes": {
      "billing_cycle_anchor": 1642150469,
      "current_period_end": 1644828869,
      "current_period_start": 1642150469,
      "items": {
        "data": [
          {
            "billing_thresholds": null,
            "created": 1642150470,
            "id": "si_KxgwlJyHxmgJKx",
            "metadata": {},
            "object": "subscription_item",
            "plan": {
              "active": true,
              "aggregate_usage": null,
              "amount": 100,
              "amount_decimal": "100",
              "billing_scheme": "per_unit",
              "created": 1642145265,
              "currency": "usd",
              "id": "price_1KHkCLL14ex1CGCipzcBdnOp",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": "Monthly subscription",
              "object": "plan",
              "product": "prod_KxfXRXOd7dnLbz",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1642145265,
              "currency": "usd",
              "id": "price_1KHkCLL14ex1CGCipzcBdnOp",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": "Monthly subscription",
              "object": "price",
              "product": "prod_KxfXRXOd7dnLbz",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "exclusive",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 100,
              "unit_amount_decimal": "100"
            },
            "quantity": 1,
            "subscription": "sub_1KHlYHL14ex1CGCiIBo8Xk5p",
            "tax_rates": []
          }
        ]
      },
      "latest_invoice": "in_1KHlYIL14ex1CGCiHSj2FQyU",
      "plan": {
        "amount": 100,
        "amount_decimal": "100",
        "id": "price_1KHkCLL14ex1CGCipzcBdnOp",
        "interval": "month",
        "nickname": "Monthly subscription"
      }
    }
  },
  "id": "evt_1KHlaiL14ex1CGCi6tkmOtnK",
  "livemode": false,
  "object": "event",
  "pending_webhooks": 1,
  "request": {
    "id": "req_oKmVf1vmkkTPqA",
    "idempotency_key": ""
  },
  "type": "customer.subscription.updated"
}
